# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input(' введите порядковый номер буквы английского алфавита'))
print(f' Ваша буква - {chr(96+a)}')
